#%%
"""
Να υλοποιηθεί ένα πρόγραμμα το οποίο βρίσκει το δεύτερο μικρότερο αριθμό σε μιαλίστα, και
να τυπώνει τον αριθμό αυτό. Για παράδειγμα, για την ακόλουθη λίστα: L = [4, 6, −8, −4, 0, 7] , το
πρόγραμμαπεριμένουμε ναμας επιστρέψειτην τιμή −4 . (Υπόδειξη: Μπορείτε να δημιουργήσετε
μια συνάρτηση, η οποία δέχεται μια λίστα L , και επιστρέφει την τιμή του δεύτερου μικρότερου
αριθμού της λίστας)
"""
#%%
import numpy as np

def second_smallest(L):
    my_list = sorted(L[:])
    return(my_list[1])

L= [0, 20, 3, -5, 7, 24, -80]

print('The second smallest number in the array is =', second_smallest(L))

# %%
